# BoundingBoxXYZ Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
BoundingBoxXYZ Members
BoundingBoxXYZ Class Constructors Methods Properties See Also
---
The BoundingBoxXYZ type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| BoundingBoxXYZ | Constructs a new BoundingBoxXYZ with a default transform and extents of (-100, -100, -100) to (100, 100, 100). |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Causes the object to release immediately any resources it may be utilizing. (Inherited from APIObject.) |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| BoundEnabled | Indexed access for loops. |
| Bounds | Indexed access for loops. Use 0 for Min and 1 for Max. |
| Enabled | Defines whether the entire bounding box is enabled. |
| IsReadOnly | Identifies if the object is read-only or modifiable. (Inherited from APIObject.) |
| IsSet | Indicates whether the bounding box is set. |
| Max | Maximum coordinates (upper-right-front corner of the box). |
| MaxEnabled | Defines whether the maximum bound is active for given dimension. |
| Min | Minimum coordinates (lower-left-rear corner of the box). |
| MinEnabled | Defines whether the minimum bound is active for given dimension. |
| Transform | The transform from the coordinate space of the box to the model coordinate space. |

# See Also
BoundingBoxXYZ Class
Autodesk.Revit.DB Namespace